{
  "backend/main.mo": "Motoko actor managing shipments with add, update, and query functions, storing events and details in a map.",
  "feature_evidence.json": "Report describing a scroll-to-top routing feature with associated frontend files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files, detailing layout, components, hooks, pages, and config.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes with global styling.",
  "frontend/index.html": "Basic HTML document mounting the app root and loading the Vite entry script.",
  "frontend/src/App.tsx": "Main React app that configures TanStack Router routes wrapped in ThemeProvider and SiteLayout.",
  "frontend/src/components/ContactDetailsCard.tsx": "Component displaying email, phone numbers, office and registered addresses, and business hours in styled cards.",
  "frontend/src/components/HeaderNav.tsx": "Responsive navigation bar with logo, desktop and mobile menus, active route highlighting, and Get Quote CTA.",
  "frontend/src/components/MaintenanceScreen.tsx": "Standalone offline/maintenance screen showing an unavailable message with no navigation or backend calls.",
  "frontend/src/components/ScrollToTop.tsx": "Component subscribing to router events to reset the window scroll position to the top on navigation.",
  "frontend/src/components/ServiceCategorySection.tsx": "Component rendering a titled service category with icon and a grid of service cards separated by a divider.",
  "frontend/src/components/ServicePreviewGrid.tsx": "Grid showing four key service previews with icons and descriptions using card components.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, links, services, and contact details using icons and styled sections.",
  "frontend/src/components/SiteLayout.tsx": "Wraps the app layout with header, footer, and scroll handler around page content.",
  "frontend/src/components/StatsStrip.tsx": "Displays a four-item statistics strip with icons and values in a responsive grid.",
  "frontend/src/entry.tsx": "Defines the app entrypoint with a maintenance-mode gate that conditionally loads the full app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty module placeholder noting no backend queries are used.",
  "frontend/src/hooks/useShipmentTracking.ts": "Fetches shipment details via the backend actor based on a tracking number.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the site’s color theme and typography.",
  "frontend/src/lib/contactValidation.ts": "Validates contact form fields for required values and formatting, returning error messages.",
  "frontend/src/lib/formatters.ts": "Formats bigint nanosecond timestamps into readable date-time strings.",
  "frontend/src/lib/maintenanceMode.ts": "Exports a flag controlling whether the site runs in maintenance mode.",
  "frontend/src/main.tsx": "Bootstraps the full app with React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/AboutPage.tsx": "Implements the About page with hero content, stats, mission statements, and value cards.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission simulation, and a success alert alongside a contact details section.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero video, highlight statistics, and navigation buttons to key site sections.",
  "frontend/src/pages/ServicesPage.tsx": "Displays grouped service categories with icons and descriptions using a reusable section component.",
  "frontend/src/pages/TrackingPage.tsx": "Provides a shipment tracking UI with a disabled input and a 'coming soon' notice.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and container settings for the project.",
  "project_state.json": "Describes project state, known issues, and feature requirements for fixing scroll position on navigation."
}