{
  "backend/main.mo": "Motoko canister for managing shipments, supporting creation, event updates, and retrieval of shipment snapshots.",
  "feature_evidence.json": "Feature evidence metadata listing maintenance-mode features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files used in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and applying global background and text rules.",
  "frontend/index.html": "Base HTML page that mounts the React app and loads the entry script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping them in ThemeProvider and SiteLayout.",
  "frontend/src/components/ContactDetailsCard.tsx": "Displays company contact information and business hours using card components and icons.",
  "frontend/src/components/HeaderNav.tsx": "Responsive navigation bar with logo, desktop and mobile menus, theme-aware elements, and Get Quote button.",
  "frontend/src/components/MaintenanceScreen.tsx": "Standalone full-screen message indicating the site is offline or unpublished.",
  "frontend/src/components/ServiceCategorySection.tsx": "Renders a titled service category section with icon and a grid of service cards.",
  "frontend/src/components/ServicePreviewGrid.tsx": "Shows a four-card grid preview of key service offerings such as air, ocean, road, and warehousing.",
  "frontend/src/components/SiteFooter.tsx": "Renders the website footer with company info, quick links, services, and contact details.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with header, main content area, and footer.",
  "frontend/src/components/StatsStrip.tsx": "Displays a grid of key company statistics with icons.",
  "frontend/src/entry.tsx": "Application entry point that initializes React, maintenance mode, identity provider, and query client.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, updating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no dynamic backend queries are used.",
  "frontend/src/hooks/useShipmentTracking.ts": "Fetches shipment details for a tracking number using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/contactValidation.ts": "Validates contact form fields and returns structured error messages.",
  "frontend/src/lib/formatters.ts": "Formats bigint nanosecond timestamps into human-readable date strings.",
  "frontend/src/lib/maintenanceMode.ts": "Exports a flag that toggles global maintenance mode.",
  "frontend/src/main.tsx": "Standard app bootstrap rendering App with query client and identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, values, stats, and imagery.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation, submission simulation, and a details section.",
  "frontend/src/pages/HomePage.tsx": "Homepage with a hero banner, highlights, and links to services and contact pages.",
  "frontend/src/pages/ServicesPage.tsx": "Displays categorized logistics services with icons and descriptions.",
  "frontend/src/pages/TrackingPage.tsx": "Shipment tracking page showing a disabled 'coming soon' form.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing site structure, known issues, and architectural notes."
}