{
  "backend/main.mo": "Minimal Motoko canister actor with no implemented methods.",
  "feature_evidence.json": "Feature report describing implemented website pages, components, and associated files for verification.",
  "frontend-file-summaries.txt": "JSON-style list summarizing each frontend file's purpose and role in the static site.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables and light/dark theme tokens applied globally.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React root config setting up TanStack Router routes and wrapping the app in ThemeProvider.",
  "frontend/src/components/ContactDetailsCard.tsx": "Displays contact info and business hours using cards with icons.",
  "frontend/src/components/HeaderNav.tsx": "Responsive header with logo, nav links, theme-based logo switching, and mobile sheet menu.",
  "frontend/src/components/ServiceCategorySection.tsx": "Renders a titled service category with icon and grid of service cards.",
  "frontend/src/components/ServicePreviewGrid.tsx": "Grid preview of four primary freight services with icons and descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, quick links, services, and contact details.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with header, footer, and main content layout.",
  "frontend/src/components/StatsStrip.tsx": "Displays a set of logistics-related stats with icons in a grid strip.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are used.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/lib/contactValidation.ts": "Validates contact form fields for name, email, service, and message.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, stats, values, and imagery.",
  "frontend/src/pages/ContactPage.tsx": "Implements the contact form with validation, submission state, and contact details section.",
  "frontend/src/pages/HomePage.tsx": "React page rendering the home hero, highlights, stats, and service preview sections with CTA links and imagery.",
  "frontend/src/pages/ServicesPage.tsx": "React page defining structured freight service categories and passing them to section components for display.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, shadows, animations, and container settings with plugins.",
  "project_state.json": "Project metadata describing site purpose, required features, image assets, and current state configuration."
}