{
  "backend/main.mo": "Motoko canister managing shipments with CRUD-like functions for adding shipments and events and querying details or all shipments.",
  "feature_evidence.json": "Feature evidence metadata listing implemented frontend entry‑point behaviors, affected files, components, and associated requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files and components across the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark mode with global background and text styles.",
  "frontend/index.html": "HTML entry file mounting the root element and loading the custom React entry module entry.tsx.",
  "frontend/src/App.tsx": "React app root configuring TanStack Router routes and wrapping them with a ThemeProvider and shared layout.",
  "frontend/src/components/ContactDetailsCard.tsx": "Component rendering contact information and business hours using card UI elements and icons.",
  "frontend/src/components/HeaderNav.tsx": "Responsive navigation header with logo, route links, theme‑aware branding, and mobile sheet menu.",
  "frontend/src/components/ServiceCategorySection.tsx": "Reusable section component rendering a category title, icon, and a grid of service cards with descriptions.",
  "frontend/src/components/ServicePreviewGrid.tsx": "Grid of four highlighted freight service previews with icons, titles, and short descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with company info, navigation links, services list, and contact details.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main layout wrapping pages with a header, content area, and footer.",
  "frontend/src/components/StatsStrip.tsx": "Displays a row of logistics-related statistics with icons and values.",
  "frontend/src/entry.tsx": "Initializes the React app with Internet Identity and React Query providers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and handles login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no dynamic backend queries are used.",
  "frontend/src/hooks/useShipmentTracking.ts": "Fetches shipment details from the backend actor based on a tracking number.",
  "frontend/src/index.css": "Defines global Tailwind CSS variables, themes, and base typography styles.",
  "frontend/src/lib/contactValidation.ts": "Validates contact form fields and returns structured error messages.",
  "frontend/src/lib/formatters.ts": "Formats bigint timestamps into human-readable date strings.",
  "frontend/src/main.tsx": "Bootstrap file that mounts the app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, values, stats, and imagery.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation, submission simulation, and a details panel, showing success or errors depending on form state.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section, service highlights, stats, and navigation links to services and contact pages.",
  "frontend/src/pages/ServicesPage.tsx": "Displays categorized freight services with icons and descriptions using a reusable category section component.",
  "frontend/src/pages/TrackingPage.tsx": "Shipment tracking page with a disabled input and button, showing a 'Coming Soon' alert for the unimplemented tracking feature.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata file describing project state, requirements, architectural notes, and known issues for the freight website."
}