{
  "kind": "build_request",
  "title": "Disable public production UI (rollback substitute) by showing an Offline/Maintenance screen",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Add an app-wide “site disabled / maintenance mode” gate that, when enabled, prevents the marketing website UI (routes, header, footer, pages) from rendering and instead renders a single standalone screen indicating the app is offline/unpublished.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "you made it to production. i dont want to publish. can you rollback"
        ]
      },
      "acceptanceCriteria": [
        "When the disabled gate is enabled, loading any route (e.g., /, /about, /services, /contact, /tracking) displays only the offline/maintenance screen.",
        "The offline/maintenance screen contains clear English text that the site is not available / not published and to check back later (no internal navigation links).",
        "When the disabled gate is enabled, no page content from Home/About/Services/Contact/Tracking is visible and no calls to backend actors are initiated from the UI as part of rendering.",
        "When the disabled gate is disabled, the app renders normally with existing routes and layout unchanged."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Implement the disabled/maintenance gate as a simple, explicit configuration mechanism that can be changed without touching immutable frontend paths (e.g., by toggling a single constant or reading a Vite environment variable in the non-immutable entry path currently used by the app: `frontend/src/entry.tsx`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "can you rollback"
        ]
      },
      "acceptanceCriteria": [
        "The toggle point for enabling/disabling the maintenance screen is located in `frontend/src/entry.tsx` (or another non-immutable file imported by it).",
        "No files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui` are modified.",
        "`frontend/index.html` continues to load `/src/entry.tsx` as the single entry module."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "This change must not rely on any ability to programmatically “unpublish” or “rollback” a production deployment; instead, it must be achieved via app behavior changes within this codebase."
  ],
  "nonGoals": [
    "Do not implement deployment tooling changes (e.g., DFX rollback, canister uninstall, domain unmapping) because they are outside the application codebase.",
    "Do not add new product features unrelated to disabling the public UI (no new pages, tracking functionality, or content redesign)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}