{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update branding logo and company contact/address details",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Add uploaded logo as a public asset and update header branding to use the new logo + company name “Di Logisolutions”, with correct light/dark rendering and Home link.",
      "acceptanceCriteria": [
        "A new static asset exists at a stable public path (e.g., `/assets/frgmtlogo.png` or similar) that matches the uploaded `frgmtlogo.png`.",
        "The header shows the new logo image instead of the current Package icon block and no longer displays “GlobalFreight”.",
        "The company name displayed in the header is “Di Logisolutions”.",
        "Header branding remains visible/legible in both light and dark theme modes."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/frgmtlogo.png",
          "operation": "create",
          "description": "Add the user-provided `frgmtlogo.png` into static assets so it is served from a stable public path (e.g., `/assets/frgmtlogo.png`)."
        },
        {
          "path": "frontend/src/components/HeaderNav.tsx",
          "operation": "modify",
          "description": "Replace the current icon + “GlobalFreight” header branding with the new logo image from `/assets/frgmtlogo.png` and the company name “Di Logisolutions”, keep the branding wrapped in a TanStack Router <Link> to Home, and ensure the logo remains legible in both light and dark themes (e.g., via theme-aware container/background/filters as needed)."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update all UI company/contact details (footer and contact details card at minimum) to the exact provided office address, registered address, phones, and email with proper mailto/tel links.",
      "acceptanceCriteria": [
        "The footer contact section shows email `info@dilss.in`, phone numbers `+91-9568740074` and `011-41447376`, and the office address in New Delhi exactly as provided.",
        "The Contact page details card(s) show the updated email, phone number(s), and office address exactly as provided.",
        "Email links use `mailto:info@dilss.in` and phone links use `tel:+919568740074` and `tel:01141447376` (or equivalent valid tel URIs) while displaying the numbers as provided.",
        "The registered address is visible somewhere appropriate in the existing contact/company info UI (footer and/or contact details), labeled clearly as “Registered address”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update footer company/contact text to: Email `info@dilss.in` (as a `mailto:info@dilss.in` link), Phone `+91-9568740074` and `011-41447376` (as `tel:+919568740074` and `tel:01141447376` links while displaying the numbers as provided), Office Address exactly “Di LOGISOLUTIONS, A89, ROAD NO 2, MAHIPALPUR, NEW DELHI,110037”, and add the Registered address exactly “RZK-2/326-I, Khasra No. 85/17, Block K-2, Nihal Vihar, Nangaloi, West Delhi, Delhi, 11004” labeled as “Registered address”. Also replace any “GlobalFreight” company name mention in the footer brand block with “Di Logisolution” where the footer displays the company name."
        },
        {
          "path": "frontend/src/components/ContactDetailsCard.tsx",
          "operation": "modify",
          "description": "Update the Contact Information card to display the provided email, both phone numbers (each as its own clickable `tel:` link), and the office address exactly as provided; add the registered address labeled clearly as “Registered address” in an appropriate place in the details UI; ensure the displayed values match the exact text and the link URIs match the acceptance criteria."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Replace remaining “GlobalFreight” brand mentions in prominent marketing headings/titles (Home/About hero and section headings) with the updated “Di Logisolutions/Di Logisolution” branding while keeping structure unchanged.",
      "acceptanceCriteria": [
        "No prominent header/footer or page hero titles display the old brand name “GlobalFreight”.",
        "Key headings that previously referenced the old brand are updated to the new branding while keeping the overall page structure unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace prominent Home page marketing headings/titles that mention “GlobalFreight” (e.g., the hero headline and the “Why Choose …” heading) with the updated branding (“Di Logisolutions” or “Di Logisolution” as appropriate) without changing the existing page layout/structure."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Replace prominent About page hero title “About GlobalFreight” and other key marketing copy references (e.g., “What sets GlobalFreight apart…”, image alt text if present) with the updated branding (“Di Logisolutions” or “Di Logisolution” as appropriate) while keeping the page structure unchanged."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure any remaining footer brand mentions in headings/titles (e.g., the footer brand name text) no longer use “GlobalFreight” and instead use the updated branding consistently (aligning with other UI updates from REQ-34)."
        }
      ]
    }
  ]
}