{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix blank page by switching to a resilient React entry module",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Add a resilient React entry module that always mounts <App /> to #root with exactly one QueryClientProvider and InternetIdentityProvider.",
      "acceptanceCriteria": [
        "Running `pnpm run dev` renders the site content (header/nav and Home page) instead of a blank screen.",
        "The React entry point renders `<App />` and includes `QueryClientProvider` and `InternetIdentityProvider` wrappers exactly once (no duplicate React Query provider in the mounted tree).",
        "No user-facing text is changed as part of this fix (only mounting/bootstrapping behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/entry.tsx",
          "operation": "create",
          "description": "Create a new React entry module that imports global styles, creates a single React Query QueryClient instance, and mounts a React element tree to the '#root' element by rendering <App /> wrapped exactly once with QueryClientProvider and InternetIdentityProvider. Use the selected 'core-infrastructure' component patterns for the React app entry point where applicable; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Avoid editing immutable entry-point and hook files by switching index.html to load the new entry module instead of src/main.tsx.",
      "acceptanceCriteria": [
        "No changes are made to any immutable paths listed by the platform (including frontend/src/main.tsx and Internet Identity hook files).",
        "frontend/index.html loads the new entry module and the app renders correctly.",
        "The build (`pnpm run build`) and preview (`pnpm run preview`) still work and show the same pages/routes."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the Vite module script import to load the new entry module (e.g., /src/entry.tsx) instead of /src/main.tsx, ensuring local dev, build, and preview mount the app even if frontend/src/main.tsx is empty."
        }
      ]
    }
  ]
}